onvif/hikvision_xml/autogen_test.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:wsa="http://www.w3.org/2005/08/addressing"
	xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
	xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
	xmlns:tt="http://www.onvif.org/ver10/schema"
	xmlns:ter="http://www.onvif.org/ver10/error"
	xmlns:tptz="http://www.onvif.org/ver20/ptz/wsdl">
<s:Header>
    <Security s:mustUnderstand="1" xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
        <UsernameToken>
            <Username>gimusr</Username>
            <Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">+LEnv7gQnqMyrC438nzbmIyWdCY=</Password>
            <Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">Q3+snfB9m4S8+sCpsnaHY+EiCyw=</Nonce>
            <Created xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">2019-02-12T11:57:11.000Z</Created>
        </UsernameToken>
    </Security>
</s:Header>
<s:Body>
	<tptz:AbsoluteMove>
	<tptz:ProfileToken>Profile_1</tptz:ProfileToken>
		<tptz:Position>
			<tt:PanTilt x="0.58" y="-0.34"/>
			<tt:Zoom x="0.00"/>
		</tptz:Position>
	</tptz:AbsoluteMove>
</s:Body>
</s:Envelope>
